Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlopeTailInsideSlopeLine Property
 The tails of slope arrows must not lie in interior of slope defining lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlopeTailInsideSlopeLine { get; }
Public Shared ReadOnly Property SlopeTailInsideSlopeLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlopeTailInsideSlopeLine {
	FailureDefinitionId^ get ();
}
static member SlopeTailInsideSlopeLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace